//Переменная - это именнованая ячейка памяти, в которой хранятся данные. 

//Типы данных:
// 1. Целочисленные:
//  char, 1 байт, -128 ... 127;
//  short, 2 байта, -32768 ... 32767;
//  int, 4 байта, -2^31 ... 2^31-1;
//  long long, 8 байт, -2^63 ... 2^63-1;
//  unsigned char/short/int/long long, 1 байт/ 2 байта/ 4 байта/ 8 байт;
// 2. Символьные:
//  char, 1 байт, -128 ... 127;
// 3. Вещественные:
//  float, 4 байта, 6-7 цифр;
//  double, 8 байт, 15-16 цифр;
// 4. Логические:
//  bool, 1 байт, true/false;


#include <iostream>
#include <cmath>
#include <iomanip>
using namespace std;

int main()
{
   setlocale(LC_ALL, "Russian");

   cout << "char - " << "Целочисленные," << " " << "размер: 1 байт," << " " << "мин.значение: -128," << " " << "макс. значение: 127" << endl;
   cout << "short - " << "Целочисленные," << " " << "размер: 2 байта," << " " << "мин.значение: -32768," << " " << "макс. значение: 32767" << endl;
   cout << "int - " << "Целочисленные," << " " << "размер: 4 байта," << " " << "мин.значение: -2^31," << " " << "макс. значение: 2^31-1" << endl;
   cout << "long long - " << "Целочисленные," << " " << "размер: 8 байт," << " " << "мин.значение: -2^63," << " " << "макс. значение: 2^63-1" << endl;
   cout << "char - " << "Символьные," << " " << "размер: 1 байт," << " " << "мин.значение: -128," << " " << "макс. значение: 127" << endl;
   cout << "float - " << "Вещественные," << " " << "размер: 4 байта," << " " << "мин.значение: 6 цифр," << " " << "макс. значение: 7 цифр" << endl;
   cout << "double - " << "Вещественные," << " " << "размер: 8 байт," << " " << "мин.значение: 15 цифр," << " " << "макс. значение: 16 цифр" << endl;
   cout << "bool - " << "Логические," << " " << "размер: 1 байт," << " " << "значение: true/false" << endl;

   char a = 125;
   char b = -120;
   cout << a + b << endl;

   short c = 30576;
   short d = 2145;
   cout << c + d << endl;

   int e = 2300;
   int f = 54000;
   cout << e * f << endl;

   long long j = 500000000;
   long long i = 4000000000;
   cout << j * i << endl;

   char g = 64;
   cout << g << endl;  // Программа выдаст символ "@", исходя из таблицы ASCII

   float n = 27;
   float m = 8.0f;
   cout << n / m << endl;

   double r = 728.0;
   double k = 39.0;
   cout << setprecision(10) << r / k << endl;

   int num1 = 12;
   int num2 = 24;
   bool total1{ num1 > num2 }; // Программа выведет 0 (False), так как 12 меньше 24
   cout << total1 << endl;

   int num3 = 12;
   int num4 = 24;
   bool total2{ num1 < num2 }; // Программа выведет 1 (True), так как 24 действительно больше 12
   cout << total2 << endl;

}
